//docref=app.documents.add(300,200)
docref = app.activeDocument;

var ids = new Array();
var id = 2017000
var names = ["闫增岗", "殷艺宁", "朱玉文", "郭东瑜", "杨  杰", "于继凯", "杨  澜", "包响丽", "莫永盈", "陆琼雯", "黄鑫皓", "叶玉萍", "乔青青", "李  力", "刘  浪", "杨金锁", "邹晨露", "童  彤", "侯少辉", "阮如刚", "蔡颖锋", "贺  雪", "焦淑娜", "刘  荣", "余荣花", "张子君", "张玉莹", "李  昂", "李秀文", "孙颖聪", "奚玮杰", "何志松", "王  旭", "姜志敬", "关子心", "谢  江", "朱亚飞", "王瀛帜", "潘芮宁", "李寸若", "王俊杰", "阴  越", "柳  颖", "刘美麟", "李思源", "孙浩博", "李雪钰", "丛  杨", "秦倪佳", "张  敏", "杨安迪", "罗嘉盛", "郑榕晟", "李雅雯", "黄宇丹", "汤子安", "李能廷", "秦文华", "崔文硕", "昝增华", "沈伟清", "康多伟", "何加欢", "陈韦辰", "施  怡", "刘子晟", "李德赟", "钱启源", "钟  柯", "宋文媛", "张梦柯", "龙怀航", "周凌聪", "王云冰", "顾  雯", "胡飞鸿", "匡亚琦", "何宇蓓", "林晓枫", "郁婧雅", "沈泽圆", "蒋梦阳", "张晓杰", "钱泓霏", "龚燕芬", "王雪萍", "黄嘉豪", "朱立凯", "黄珊珊", "李青青", "陈  倪", "童  淦", "王  鑫", "杨  洋", "高昕雨", "许  引", "赵泽昊", "邱贤昌", "杨渊源", "陈永奇", "王  威", "罗义国", "高柱成", "韦军全", "李孟可", "赵  波", "鲁杰文", "高炜翔", "李  强", "付志永", "管万里", "周玉岭", "付士朔", "汪立强", "向仁伟", "岳永泰", "王  灿", "李成禛", "李俊达", "李钰杰", "王京京", "米琢瑀", "范永清", "张思明", "唐德政睿", "王  鹏", "卢钢辉", "王启康", "何  进", "汪  锋", "陈建君", "刘和平", "何振兴", "王东海", "张冰涛", "王  缘", "冯海松", "莫  杰", "黄子亮", "蔡文才", "韩洋", "鲁  鹏", "崔建军", "郭文海", "花伟凯", "庄锦前", "厉钦楠", "翟鑫源", "黄双港", "程鹏洋", "涂贵辉", "彭飞鸿", "陈柯君", "王昀焘", "陈万书", "刘泓伯", "姚  倩", "方  赢", "黄佳丽", "梁晓春", "董浩明", "黎新蕊", "侯欣慧", "廖  烜", "付楠楠", "张伟", "王维娟", "罗文朋", "孙萌雅", "罗  欢", "李文滔", "何瑜民青", "严佑锐凌", "伍  川", "张智涵", "户小霞", "陈  宇", "范淮裕", "马宁丽", "王  萱", "管  盛", "陈欣泽", "王雪纯", "史新森", "葛晨媛", "李林雨", "赵崇钧", "李  聪", "李洁莹", "苏丽莉", "张  旭", "吕诗嘉", "钱叶蓉", "邱宇霆", "庞国霖", "李浚璇", "许  颖", "祝明冲", "罗豪东", "刘思艺", "凌  巧", "何世定", "蒋肖锋", "洪  怡", "吴玲玲", "景  暄", "沈  阳", "史沈凡", "初文琴", "陈  姗", "施薪波", "李济安", "李美琪", "康奕雯", "栾思纬", "王  凯", "王宏樟", "金  煜", "王松威", "翟卓群", "邵  鑫", "许子威", "霍思宇", "陈旭运", "雷乐斌", "马金威", "夏炜豪", "张  哲", "申  林", "周思源", "王  猛", "胡阳林", "蒲  庆", "汪力航", "李伊想", "李  伟", "方方亮", "白建军", "温  许", "周谦峰", "于豪男", "刘丞庭", "满昌豪", "施万富", "毕京昆", "高建斗", "马  东", "梅景涛", "付宇翔", "韦立斌", "张鹤铧", "李柯男", "莫国政", "高斐斐", "叶兴宋", "章贤浩", "徐盟迪", "沈孝东", "刘海为", "王方方", "杜亨特", "宁浩妃", "汤  凤", "廖  萍", "李昊轩", "陈艺雯", "夏盼琳", "滕玥霖", "郭随弈", "仓  颉", "王  毅", "赵小丫", "王  琳", "叶荣金", "刘  飘", "范津菲", "危贤文", "许锦辉", "孙小媛", "杨子轶", "王洁銮", "张馨元", "李晓雪", "袁荣丰", "史好好", "王  杰", "赵子豪", "韦  祎", "李郁悦", "金燕姗", "林  昕", "方渊媛", "陈文峰", "李丹丹", "徐  瀚", "李诗慧", "王子杰", "林祖权", "杜雨桐", "王子璇", "张聪伟", "周智敏", "翁忠铭", "姜文怡", "李函笑", "田欣颐", "唐林馨", "张雨萌", "景卓然", "陆  申", "张明晨", "张庭瑞", "李玉林", "檀 玲", "栾  林", "李荟彬", "许巧玲", "林  芳", "郭  盼", "魏  聪", "陈斌铧", "马  骁", "张泉泉", "曹士悦", "慕容丽雯", "李华南", "周建军", "王一敏", "罗永冠", "范朝朝", "桑  娜", "邢铭杨", "吴九佳", "马国蕊", "闫劲宇", "束文彦", "张怀智", "张琛琪", "汪芳斌", "康佳臣", "林倩倩", "夏  俊", "汤小琢", "肖佑鹏", "颜丽婷", "李志强", "张  羚", "吴  静", "蔡宛辰", "宋  珂", "杨清源", "温  健", "朱国娟", "曹文辉", "付定甜", "张海亭", "李根泽", "陶春燕", "王  蓉", "侯雨苇", "施靖怡", "李心怡", "李  瑶", "李  龙", "杨泽旭", "包轶谦", "李竹君", "钱  蕾", "莫恒婷", "高尚荦", "张永阳", "任树缘", "全怡臻", "唐依玲", "方俊辉", "孟宪泽", "杨  洋", "江  楠", "程婉茹", "陆香健", "陈可欣", "陈奕君", "陈今昊", "陈爱玲", "陈静仪", "侯力瑗", "宋文倩", "扶建方", "姜  洁", "吴文彧", "申佳依", "邱邦楷", "王心悦", "陆鸣鸣", "郑欣艳", "朱胤迪", "曾家伟", "赖明苒", "王  恒", "鹿  莹", "张嘉铃", "范楚楚", "李昊宸", "张荆京", "李  雯", "林佳芸", "孙舒悦", "刘纹妤", "沈芯悦", "温雅婷", "黄玉萍", "李  洁", "张  梦", "曹博依", "陆婷婷", "王  婷", "陆  进", "刘  甜", "陈颖鑫", "陈  盛", "卓  帅", "尹昱苏", "文登鑫", "张羽娆", "陈  晨", "李  倩", "庞皓天", "蒋晓宇", "白朝晖", "苗艺馨", "兰雅文", "连一霖", "王  雷", "黄樱樱", "冒陈冬", "盛  祥", "左  琳", "窦  赟", "余晏璐", "孙诗卉", "周晋扬", "顾丹婷", "陈珊珊", "罗凤娇", "李福海", "郭振辉", "陈珍玲", "杨  欣", "徐丽娜", "王泓霁", "刘凯晨", "刘朝明", "刘一衡", "纪  晴", "谢泽昊", "金一凡", "王友艳", "罗其萍", "庞  琦", "卢嘉杰", "李  倩", "李云凯", "徐世华", "李阳浩", "谢  珂", "龚旻超", "陈海翠", "曾钰茹", "周冰洁", "曹国立", "常娜娜", "曾远伟", "柳志全", "常佳鑫", "柴宇枫", "葛听雨", "丁  燕", "戚雄飞", "龚  璞", "顾佳囡", "顾昕嵛", "马蔚沁", "朱韵捷", "王鹏鹏", "郭子瑜", "梁  涛", "朱领领", "汪班涛", "周雪琼", "周伟伦", "苏凡云", "赵高峰", "郭帆帆", "郭义芬", "何兴宝", "韩忆彤", "赵祎烈", "刘梓琳", "尤胜金", "陆宏莲", "马天威", "毛昊强", "蒙世航", "潘  严", "裴  毅", "钱一歆", "卢  叶", "任宏远", "沙精滢", "屈国珍", "师文杰", "苏湛宇", "石晶晶", "宋垠磊", "汤嘉鸣", "孙志文", "沙林林", "向田田", "郭振明", "徐佳宁", "徐萌琰", "孙红红", "徐雪丰", "许传林", "许梦羽", "严慧康", "叶慧玲", "谭光美", "严  莹", "杨栋妮", "叶嘉慧", "杨  涛", "杨  艺", "叶凌志", "张  瑜", "武秋香", "程嘉琦", "张政虎", "陈浩宇", "闫莉莉", "陈万里", "谢丽香", "谌  鹏", "崔广鹏", "邓胜杰", "丁 斌", "董  丰", "丁方顺", "徐逸雯", "丁银银", "梁家源", "丁成林", "都海潮", "杜锦涛", "付亚楠", "钟海兰", "高  尚", "李鑫垚", "李莹钰", "梁仕兵", "高  颖", "林  杰", "林雅仪", "刘  达", "刘慧琳", "王培豪", "刘慧敏", "刘锦峰", "刘康文", "刘仕奇", "刘潇航", "刘亚娟", "刘一桐", "黄嘉峰", "邹文辉", "吴鸣迪", "王  超", "王放舟", "王海龙", "王赫逸", "费佩丽", "王  巧", "王思宇", "吴  艳", "姜嘉文", "王雪微", "王耀杰", "王镒杰", "王子浩", "魏梦媛", "文睿钧", "武昕阳", "夏呈祥", "夏  静", "徐紫荆", "李荣中", "李  潘", "李露婵", "李丽丽", "匡佳明", "胡锦磊", "胡卓群", "黄  林", "李静茹", "严雯静", "金雨若", "金   菁", "焦世超", "张  林", "贾帅龙", "贾明慧", "黄正秋", "李亚萍", "周文艳", "王晓洁", "贠文强", "袁胤钦", "袁云杰", "张  峰", "张皓文", "张红兵", "张慧颖", "张佳逸", "高子燕", "张家福", "张  晶", "张  晶", "张敬国", "王  艳", "张楷祥", "牛  震", "郭金枫", "秦林涛", "岳  亮", "王爱萍", "张入铭", "张  涛", "谢  平", "张嫣然", "张友利", "丁文丽", "张雨新", "张越洋", "张宇帆", "章文睿", "赵  博", "张泽洲", "李鑫昕", "赵  楠", "姜小虎", "况天阳", "李佳囡", "朱明君", "周  莉", "祝佳伟", "诸彦仑", "姜枢南", "杨  骁", "张思琪", "凡欣欣", "胡  慧", "陈丽君", "孟  鑫", "黄熙宸", "李嘉琪", "王  立", "吴佳霖", "左今朝", "朱富强", "金宇雯", "张  巍", "汤文铃", "金亦卫", "龚文鑫", "蒋安庆", "张  臻", "宋嘉晟", "胡倩颖", "冯  雨", "朱轶涛", "苟彦杰", "杨  森", "陈  杨", "翁悦飞", "梁泽鹏", "李小雨", "刘梅钦", "吴守浩", "贺如意", "黄  珺", "梁楚婷", "康卓君", "罗婉祯", "王勇超", "邹宇城", "石开宇", "程  岚", "李江灏", "何  鹏", "任悠扬", "徐  瑜", "张小秀", "闵  欣", "张光璞", "陈旭昊", "赵敏洁", "卢秋雨", "潘文杰", "李  欣", "许玉璋", "孙慰齐", "陈佳俊", "李霖昱", "刘梦醒", "孙彩越", "赵  劲", "郭佳怡", "李逸文", "王梓微", "麹  奔", "董  赟", "夏  进", "瞿莲莲", "顾博文", "陈  明", "李梦雨", "黄  一", "杨丰瑞", "周冬霜", "葛晓聪", "张晓敏", "余海航", "龚锳泽", "祁智颖", "李  黛", "吴君荟", "肖佳俊", "周倪辉", "施俊杰", "汪  s", "褚雨墨", "王子壬", "付睿婧", "丁  婕", "谢  津", "陈超群", "蒋映荷", "王露荷", "张悦琳", "钟梓瑜", "吉顺意", "李  耀", "钟德江", "张雨洁", "詹旦娜", "史浩田", "张雅婕", "童一凡", "谭  静", "胡海容", "钱盈如", "陈虹邑", "熊唐磊", "程娉婷", "邓跃杰", "詹哲轶", "富  蕾", "甘黎琳", "周真真", "段  磊", "杨  辉", "党廷雨", "朱佳艺", "魏晨威", "潘宁一", "徐思雯", "苏义勇", "陈  雨", "陈松怡", "李方林", "梁国耀", "张诚建", "陈嘉巍", "金婷鹄", "周嘉楠", "蒋  慧", "黄欣乐", "姚紫航", "蒋  洁", "崔一凡", "张钦华", "姚姝萍", "谢妍婷", "何  月", "邹文君", "柏云飞", "杨文丽", "黄丽丽", "陈  哲", "赵俊胜", "沈依琳", "刘丽娟", "宋鹏丽", "刘凌志", "胡耀尹", "洪富森", "姚瑾以", "吴燕南", "刘  洋", "吕利曼", "王青洋", "王乐妍", "刘  媛", "王  圣", "丁  浩", "孙静雯", "苌雨婷", "冯煜陶", "沈慧茹", "田梓琪", "何志承", "朱若嘉", "黄  兴", "邱治源", "沈  策", "欧阳伽蓝", "潘妍良", "柴雪菲", "郭雨琪", "管  玺", "黄  浩", "於婷婷", "陈施言", "谈  慧", "赵文哲", "徐发文", "兰  叶", "郁家友", "林  博", "寇晋瑜", "张  权", "赵晶晶", "付袈铭", "丁晓岚", "赵韵怡", "曹加林", "施春笑", "陈  晶", "陈明霖", "李泽宇", "刘晴晴", "周秀峰", "武静雯", "尹九龙", "刘振鹏", "张娇娇", "赵  静", "邱晓慧", "曹励静", "邓艳欣", "向  菲", "曹佳莉", "张效清", "张发春", "颜铖涛", "简昊然", "黎翔", "许星伟", "孙豪亮", "孙泳", "陈宇", "胡凌云", "董俊杰", "席圣杰", "李若一", "王彬", "陈敦耀", "姚旭", "杨凯翔", "杨宙", "姜宇暘", "朱元浩", "王书奇", "李恺", "孔惟雪", "钟启宇", "宋晨睿", "施文"];

for(var i = 0; i<888; i++){
      id = id + 1;
      ids[i] = id
}

var prePath = "C:\\jpeg\\";

for(var i = 0; i<888; i++){
    //定义编号属性
    r1=12;
    g1=55;
    b1=222;

    //定义位置
    x1=2060;
    y1=270;

    var layerRef1 = docref.artLayers.add();
    layerRef1.kind = LayerKind.TEXT;
    var textItemRef1 = layerRef1.textItem;

    var textContent1 = ids[i];
    textItemRef1.contents = textContent1;

    //font
    textItemRef1.font= 0;

    //size
    textItemRef1.size=18;
    //position
    textItemRef1.position=Array(x1,y1);

    //color
    var textcolor1= new SolidColor;
    textcolor1.rgb.red=r1;
    textcolor1.rgb.green=g1;
    textcolor1.rgb.blue=b1;
    textItemRef1.color=textcolor1;
    
    //定义姓名属性
    r2=0;
    g2=0;
    b2=0;

    //定义位置
    x2=520;
    y2=1750;

    var layerRef2 = docref.artLayers.add();
    layerRef2.kind = LayerKind.TEXT;
    var textItemRef2 = layerRef2.textItem;

    var textContent2 = names[i];
    textItemRef2.contents = textContent2;

    //font
    textItemRef2.font= 10;

    //size
    textItemRef2.size=14;
    //position
    textItemRef2.position=Array(x2,y2);

    //color
    var textcolor2= new SolidColor;
    textcolor2.rgb.red=r2;
    textcolor2.rgb.green=g2;
    textcolor2.rgb.blue=b2;
    textItemRef2.color=textcolor2;
    
    var savePath = prePath +ids[i] + "-" + names[i] + ".jpeg";
    var fileOut = new File(savePath);
    SaveJPEG(fileOut,12);
    layerRef1.remove();
    layerRef2.remove();
}

function SaveJPEG(fileOut, jpegQuality) {  
    jpgSaveOptions = new JPEGSaveOptions();  
    jpgSaveOptions.embedColorProfile = true;  
    jpgSaveOptions.formatOptions = FormatOptions.STANDARDBASELINE;  
    jpgSaveOptions.matte = MatteType.NONE;  
    jpgSaveOptions.quality = jpegQuality; 
    activeDocument.saveAs(fileOut, jpgSaveOptions, true,Extension.LOWERCASE);  
}